In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\naman\anaconda3\lib\site-packages (1.1.3)Note: you may need to restart the kernel to use updated packages.

Requirement already satisfied: pytz>=2017.2 in c:\users\naman\anaconda3\lib\site-packages (from pandas) (2020.1)
Requirement already satisfied: numpy>=1.15.4 in c:\users\naman\anaconda3\lib\site-packages (from pandas) (1.19.2)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\naman\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: six>=1.5 in c:\users\naman\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

In [3]:
import pandas as pd

In [4]:
import numpy as np

In [4]:
df = pd.DataFrame()

In [5]:
df

Empty DataFrame
Columns: []
Index: []

In [6]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [7]:
df1 = pd.DataFrame([[1,2,3,4],[5,6,7,8],[8,9,23,44],[67,88,90,56]])

In [8]:
df

Empty DataFrame
Columns: []
Index: []

In [9]:
df1

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   8   9  23  44
3  67  88  90  56

In [11]:
df1.head(3)

   0  1   2   3
0  1  2   3   4
1  5  6   7   8
2  8  9  23  44

In [12]:
df1.head(4)

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   8   9  23  44
3  67  88  90  56

In [13]:
df1.head(5)

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   8   9  23  44
3  67  88  90  56

In [14]:
df.tail(2)

Empty DataFrame
Columns: []
Index: []

In [15]:
df1.tail(2)

    0   1   2   3
2   8   9  23  44
3  67  88  90  56

In [17]:
df1.shape

(4, 4)

In [18]:
df1.iloc[0,1]

2

In [19]:
df1.iloc[0:2,0:2]

   0  1
0  1  2
1  5  6

In [23]:
df1.iloc[0:2,]

   0  1  2  3
0  1  2  3  4
1  5  6  7  8

In [24]:
df1.iloc[:,1:3]

    1   2
0   2   3
1   6   7
2   9  23
3  88  90

In [29]:
df2 = pd.DataFrame(np.arange(20).reshape(4,5),columns = ['A','B','C','D','E'])

In [30]:
df2

    A   B   C   D   E
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [33]:
df2.to_csv('export.csv',index=False)

In [5]:
dates = pd.date_range("20140701",periods=7)
dates

DatetimeIndex(['2014-07-01', '2014-07-02', '2014-07-03', '2014-07-04',
               '2014-07-05', '2014-07-06', '2014-07-07'],
              dtype='datetime64[ns]', freq='D')

In [8]:
df = pd.DataFrame(np.random.randn(7,5), index = dates , columns = list("ABCDE"))
df

                   A         B         C         D         E
2014-07-01  0.051279  0.313476 -1.924014 -0.128095 -1.273810
2014-07-02 -0.557195  0.088207 -1.337979 -1.293389 -0.059745
2014-07-03  0.263928 -2.301151 -0.742948 -0.685308 -0.345265
2014-07-04  0.147932 -0.028063 -0.148963 -0.941822  0.264228
2014-07-05  0.181699  0.966319  0.604538 -0.889191  0.285478
2014-07-06  0.119996 -0.266580  0.947273 -0.168567 -0.251150
2014-07-07 -0.021548 -0.574467 -0.038727  0.930826 -0.434902

In [10]:
df2 = pd.DataFrame({
    "A": 1,
    "B": pd.Timestamp.now(),
    "C": pd.Series(1,index=list(range(4)),dtype = 'int32'),
    "D": np.array([3]*4,dtype='int32'),
    "E": pd.Categorical(['Female','Male','Male','Female']),
})
df2

   A                          B  C  D       E
0  1 2021-06-11 21:45:01.261718  1  3  Female
1  1 2021-06-11 21:45:01.261718  1  3    Male
2  1 2021-06-11 21:45:01.261718  1  3    Male
3  1 2021-06-11 21:45:01.261718  1  3  Female

In [11]:
df.head()

                   A         B         C         D         E
2014-07-01  0.051279  0.313476 -1.924014 -0.128095 -1.273810
2014-07-02 -0.557195  0.088207 -1.337979 -1.293389 -0.059745
2014-07-03  0.263928 -2.301151 -0.742948 -0.685308 -0.345265
2014-07-04  0.147932 -0.028063 -0.148963 -0.941822  0.264228
2014-07-05  0.181699  0.966319  0.604538 -0.889191  0.285478

In [12]:
df.tail()

                   A         B         C         D         E
2014-07-03  0.263928 -2.301151 -0.742948 -0.685308 -0.345265
2014-07-04  0.147932 -0.028063 -0.148963 -0.941822  0.264228
2014-07-05  0.181699  0.966319  0.604538 -0.889191  0.285478
2014-07-06  0.119996 -0.266580  0.947273 -0.168567 -0.251150
2014-07-07 -0.021548 -0.574467 -0.038727  0.930826 -0.434902

In [14]:
df.index

DatetimeIndex(['2014-07-01', '2014-07-02', '2014-07-03', '2014-07-04',
               '2014-07-05', '2014-07-06', '2014-07-07'],
              dtype='datetime64[ns]', freq='D')

In [15]:
df.columns

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [16]:
df.describe()

              A         B         C         D         E
count  7.000000  7.000000  7.000000  7.000000  7.000000
mean   0.026584 -0.257466 -0.377260 -0.453650 -0.259309
std    0.273120  1.022494  1.027472  0.740593  0.528868
min   -0.557195 -2.301151 -1.924014 -1.293389 -1.273810
25%    0.014865 -0.420524 -1.040464 -0.915506 -0.390083
50%    0.119996 -0.028063 -0.148963 -0.685308 -0.251150
75%    0.164816  0.200841  0.282905 -0.148331  0.102241
max    0.263928  0.966319  0.947273  0.930826  0.285478

In [17]:
df.to_numpy()

array([[ 0.05127852,  0.3134762 , -1.92401408, -0.128095  , -1.27380973],
       [-0.55719527,  0.08820658, -1.33797946, -1.2933894 , -0.05974512],
       [ 0.26392769, -2.30115062, -0.74294804, -0.68530848, -0.34526542],
       [ 0.14793236, -0.0280632 , -0.14896345, -0.94182174,  0.26422792],
       [ 0.1816993 ,  0.96631898,  0.60453789, -0.88919088,  0.28547819],
       [ 0.11999562, -0.26658023,  0.94727349, -0.16856658, -0.25115027],
       [-0.02154804, -0.574467  , -0.038727  ,  0.93082555, -0.43490151]])

In [18]:
df.loc[:, ["A", "B"]]

                   A         B
2014-07-01  0.051279  0.313476
2014-07-02 -0.557195  0.088207
2014-07-03  0.263928 -2.301151
2014-07-04  0.147932 -0.028063
2014-07-05  0.181699  0.966319
2014-07-06  0.119996 -0.266580
2014-07-07 -0.021548 -0.574467

In [19]:
df.loc["20140701":"20140703","A":"C"]

                   A         B         C
2014-07-01  0.051279  0.313476 -1.924014
2014-07-02 -0.557195  0.088207 -1.337979
2014-07-03  0.263928 -2.301151 -0.742948

In [21]:
df.iloc[3:6,0:3]

                   A         B         C
2014-07-04  0.147932 -0.028063 -0.148963
2014-07-05  0.181699  0.966319  0.604538
2014-07-06  0.119996 -0.266580  0.947273

In [22]:
df[df["C"]>0]

                   A         B         C         D         E
2014-07-05  0.181699  0.966319  0.604538 -0.889191  0.285478
2014-07-06  0.119996 -0.266580  0.947273 -0.168567 -0.251150